Revit 2026 API

# IndexStreamPointAddPoints Method

---
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddPoints(
	IList<IndexPoint> points
)
```
```vb
Public Sub AddPoints (
	points As IList(Of IndexPoint)
)
```
```cpp
public:
void AddPoints(
	IList<IndexPoint^>^ points
)
```
```fsharp
member AddPoints :
        points : IList<IndexPoint> -> unit
```

#### Parameters

points IListIndexPoint

#### Reference

IndexStreamPoint Class

Autodesk.Revit.DB.DirectContext3D Namespace